[
  {
    "name": "ACEMAGIC Gaming Laptop, 16GB DDR4 512GB SSD 16.0inch Laptop, Windows 11 Laptop with Intel 12th N97 Processor(Up to 3.6GHz), 1920P FHD Display, Metal Shell, WiFi 6, USB3.2, Type_C, Long Battery Life",
    "price": 0.0,
    "description": "About this item【EFFICIENT PERFORMANCE】ACEMAGIC AX16 Laptop featuring the latest Intel 12th Gen Alder Lake N97 processor (4 cores/4 threads, 6MB cache, 1.7GHz base, up to 3.6GHz). Outperforming the Pentium N5030 and Celeron N5095, it delivers robust multitasking capabilities. The laptop computer has an integrated Intel UHD graphics card clocked at up to 1200MHz for stronger graphics processing performance. ACEMAGIC laptop is designed to elevate your computing experience.【Powerful Configuration】Featuring 16GB of DDR4 RAM and a speedy 512GB M.2 SSD, this notebook offers a 50% performance boost compared to DDR3-equipped machines and ensures seamless system operation while accommodating your personal files. Support expand your storage with a 128GB TF card, and enjoy the convenience of a pre-installed operating system. The 512 GB SSD can be replaced with a maximum SSD of 2TB to provide you with ample space to record and store your files/favorites.【16 INCH Visual Treat】Immerse yourself in a 16-inch laptop experience with an innovative thin-bezel display, offering more screen real estate for immersive viewing. The colors of the 16 inch traditional laptop are fuller, more vivid, and concise, the details on the screen are clearer, and the viewing angle is wide. It will create extraordinary visual effects for you.【LONG BATTERY LIFE】 Take ACEMAGIC laptop on sale with you anywhere without bringing the power adaptor. Its 38Wh long battery life gives you the flexibility to work or play anywhere for 8 hours. The long battery life and reliable performance make your life and work more secure.【ACEMAGIC Care For You】Enjoy peace of mind with unlimited technical support and a 12-month of repair for customers. Should you have any questions or concerns, please don't hesitate to reach out to us for assistance.›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/71Ls2+M7TSL._AC_SY300_SX300_.jpg",
    "url": "https://www.amazon.com/ACEMAGIC-16-0inch-Windows-Processor-Display/dp/B0DY1HT8HK/ref=sr_1_6?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-6",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:10.332736"
  },
  {
    "name": "Acer Gateway Chromebook 311 CBO311-1H-C1MX Laptop | Intel Celeron N4500 | 11.6\" HD (1366 x 768) Display | 4GB LPDDR4X | 64GB eMMC | Wi-Fi 5 802.11ac | Chrome OS | Star Black",
    "price": 134.99,
    "description": "Gateway to Productivity: Enhance your productivity with the Gateway Chromebook 311—an everyday Chromebook equipped with a fast Intel processor, a brilliant 11.6” HD anti-glare display, and housed in a 2.65-pound lightweight body. With the HD Camera and fast Wi-Fi connectivity, the Chromebook ensures you stay productive throughout your day. The Gateway Chromebook 311 is thin, light and delivers unmatched value in today’s fast-paced, technology-driven world. (NX.Y5RAA.002).",
    "rating": 4.0,
    "image_url": "https://m.media-amazon.com/images/I/61s7XxkIC5L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/acer-Gateway-Chromebook-CBO311-1H-C1MX-802-11ac/dp/B0D33NC672/ref=sr_1_15?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-15",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:16.500546"
  },
  {
    "name": "135W Charger Fit for Acer Nitro 5 N18C3 AN517-51 AN515-51 52 53 54 55 57 45 N18C4 Series Laptop",
    "price": 0.0,
    "description": "About this itemCompatibility: Compatible with Acer Nitro 5 Gaming Laptop N18C3 N18C4 AN515-31 AN515-41 AN515-42 AN515-43 AN515-51 AN515-52 AN515-53 AN515-54 AN515-56 AN517-51 AN515-57-584Y AN515-55-53AG AN515-44-R99Q AN515-55-52KW.Parameters: Input: 100-240V, 50-60Hz; Output: 19V 7.1A 135W, Connector Size: 5.5*1.7mm tip. (Do not buy if your laptops more than 135W).Safety Standards: Complies with U.S. safety standards for electronic equipment. Strict industrial manufacturing process gives the charger a longer life.What You Get: A replacement for the Acer 135W charger, a high quality cable.Service: 7x24 online support, 12 months product repair service.›See more product details",
    "rating": 0.0,
    "image_url": "https://m.media-amazon.com/images/I/51Pa5Iw1JvL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/sspa/click?ie=UTF8&spc=MTo0ODM4NTQ2Nzk5MTk4MDg0OjE3NDI3OTkyNDQ6c3BfYnRmOjMwMDExOTE1MjMzMTIwMjo6MDo6&url=%2FCharger-ADP-135KB-Nitro-Gaming-Laptop%2Fdp%2FB0CKXDX967%2Fref%3Dsr_1_21_sspa%3Fdib%3DeyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU%26dib_tag%3Dse%26keywords%3Dlaptops%26qid%3D1742799244%26sr%3D8-21-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9idGY%26psc%3D1",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:21.218915"
  },
  {
    "name": "HP Portable Laptop (Include 1 Year Microsoft 365), 14’’ HD Display, 16GB RAM, 64GB eMMC, Intel Quad-Core N4120, Student and Business, Webcam, HDMI, Wi-Fi, RJ-45, Windows 11 Home, Pink",
    "price": 219.99,
    "description": "About this item【Memory & Storage】The PC memory has been upgraded to 16GB DDR4 SDRAM for enhanced high bandwidth to easily switch back and forth between open applications; Hard drive has been upgraded to 64GB eMMC for fast boot up and speedy data transfer【Processor】Intel Celeron N4120 Processor (4 Cores, 4 Threads, Base Frequency at 1.1 GHz, Up to 2.6 GHz at Max Turbo Frequency), with Intel UHD Graphics 600【Screen】14\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSC【Tech Specs】1 x SuperSpeed USB Type-C, 2 x SuperSpeed USB Type-A, 1 x HDMI, 1 x Headphone/Mic Combo, 1 x AC smart pin, 1 x RJ-45; Wi-Fi & Bluetooth; 1 Year Office 365【Operating System】Windows 11 Home›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/61DVg3ECW-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/HP-Portable-Microsoft-Quad-Core-Business/dp/B0CHHMH36M/ref=sr_1_9?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-9",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:26.440255"
  },
  {
    "name": "HP 14\" Ultral Light Laptop for Students and Business, Intel Quad-Core, 8GB RAM, 192GB Storage(64GB eMMC+128GB Ghost Manta SD Card), 1 Year Office 365, USB C, Win 11 S",
    "price": 303.62,
    "description": "Switching out of S mode in Windows 11Windows 11 in S mode is designed for security and performance, exclusively running apps from the Microsoft Store. If you want to install an app that isn't available in the Microsoft Store, you'll need to switch out of S mode1. On your PC running Windows 11 in S mode, open Settings > System > Activation.2. In the Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.HP 14 inch Laptop for Business and Student:Sleek design: Easily take this thin and light PC from room to room or on the roadDual array microphones: With two microphones and advanced noise reduction software, you'll always sound crystal clear when you video chat or recordDisplay: 14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightViewProcessor: Intel Celeron N4120, 4 Cores & 4 ThreadsMemory: 8GB DDR4Storage: 64GB eMMC+128GB Micro SDGraphics: Intel UHD Graphics 600Operating System: Windows 11 Home in S modeHP Fast Charge: Go from 0 to 50% charge in approximately 45 minutesBattery Life: Up to 11 hours and 30 minutes (video playback); Up to 9 hours (wireless streaming)Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesConnectivity: 802.11a/b/g/n/ac (2x2)(19a) Wi-Fi and Bluetooth comboDimensions: 12.76 x 8.86 x 0.71 inchesWeight: 3.24 lbs",
    "rating": 4.0,
    "image_url": "https://m.media-amazon.com/images/I/81divYKpeTL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/HP-Students-Business-Quad-Core-Storage/dp/B0B2D77YB8/ref=sr_1_8?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-8",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:32.086343"
  },
  {
    "name": "Acer Aspire 5 15 Slim Laptop | 15.6\" FHD 1920x1080 IPS Touch | Intel Core i5-13420H | Intel UHD Graphics | 16GB LPDDR5 | 512GB Gen 4 SSD | Wi-Fi 6 | Backlit KB | Protective Sleeve| A515-58PT-50UJ",
    "price": 517.42,
    "description": "Acer Aspire 5 15 is powered by the 13th Gen Intel Core i5-13420H processor for multitasking and Intel UHD graphics for accelerated photo and video editing performance. Maximize your productivity with performance­ grade thermal solutions and comprehensive connectivity options. The narrow-bezel design provides plenty of screen so you can focus on what's in front of you, while the 15.6\" Full HD IPS touch display ensures crisp, true-to-life colors!",
    "rating": 4.3,
    "image_url": "https://m.media-amazon.com/images/I/71RkN3WRIBL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/sspa/click?ie=UTF8&spc=MTo0ODM4NTQ2Nzk5MTk4MDg0OjE3NDI3OTkyNDQ6c3BfbXRmOjMwMDUwODc0MDU5MjAwMjo6MDo6&url=%2F1920x1080-i5-13420H-Graphics-Protective-A515-58PT-50UJ%2Fdp%2FB0CV62R75W%2Fref%3Dsr_1_17_sspa%3Fdib%3DeyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU%26dib_tag%3Dse%26keywords%3Dlaptops%26qid%3D1742799244%26sr%3D8-17-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9tdGY%26psc%3D1",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:37.546636"
  },
  {
    "name": "HP 17 Laptop, 17.3\" FHD Display, 32GB RAM, 1TB SSD, AMD Ryzen 5 Processor(Beats i7-1165G7, Up to 4.3GHz), Webcam, Numeric Keypad, Long Battery Life, Windows 11 Home, Alpacatec Accessories, Silver",
    "price": 0.0,
    "description": "HP 17.3\" FHD LaptopCPU: AMD Ryzen 5 Processor (6 cores, L3 cache, up to 4.3 GHz burst frequency).Memory: Up to 32GB DDR4 RAMHard Drive: Up to 1TB PCIe Solid State DriveOperating System: Windows 11 Home in S modeDisplay: 17.3 inch diagonal Full HD(1920 x 1080) IPS Micro-Edge, Anti-glare DisplayNumeric keypad: YesGraphics: AMD Radeon GraphicsPorts:1 x USB Type-C 3.0(supports data transfer only)2 x USB Type-A 3.01 x HDMI1 x Headphone/Microphone combo1 x AC smart pin for power adapterWireless Connectivity: Wi-Fi 6 and Bluetooth 5.0 comboWebcam: HP True Vision 720p HD camera with privacy shutter. Temporal noise reduction and integrated dual array digital microphonesBattery life: Up to 9 hours battery life. HP Fast Charge goes from 0 to 50% charge in approximately 45 minutes.Weight: 4.6 poundsDimensions: 0.78 Inches (H) x 15.78 Inches (W) x 10.15 Inches (D)Color: Silver",
    "rating": 1.0,
    "image_url": "https://m.media-amazon.com/images/I/71jnYgMljgL._AC_SY300_SX300_.jpg",
    "url": "https://www.amazon.com/HP-Processor-i7-1165G7-Alpacatec-Accessories/dp/B0DP15YMQ8/ref=sr_1_13?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-13",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:42.465029"
  },
  {
    "name": "HP 15.6\" Business Laptop, Free Microsoft Office 2024 Lifetime License, Copilot AI Chat, HD Touchscreen Display, Intel 6-Core i3-1215U 4.4 GHz, 16GB RAM, 1TB SSD, Long Battery Life, Windows 11 Pro",
    "price": 0.0,
    "description": "1",
    "rating": 0.0,
    "image_url": "https://m.media-amazon.com/images/I/71xEfn8Qi8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/HP-Business-Microsoft-Lifetime-Touchscreen/dp/B0CWN27G3V/ref=sr_1_5?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-5",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:47.770994"
  },
  {
    "name": "HP Flagship 14\" Laptop with 1 Year Office 365 | 8GB RAM | 1.22TB Storage(64GB eMMC & 160GB Docking Station & 1TB Cloud Storage) | Intel 4-Core Processor| Webcam | Wi-Fi | Windows 11 | Pink",
    "price": 0.0,
    "description": "HP Flagship 14\" Laptop",
    "rating": 0.0,
    "image_url": "https://m.media-amazon.com/images/I/81YJHEZLk8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/sspa/click?ie=UTF8&spc=MTo0ODM4NTQ2Nzk5MTk4MDg0OjE3NDI3OTkyNDQ6c3BfbXRmOjMwMDY4MzI2NzQ1NzEwMjo6MDo6&url=%2FHP-Flagship-Storage-Docking-Processor%2Fdp%2FB0DQ3WLQWM%2Fref%3Dsr_1_12_sspa%3Fdib%3DeyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU%26dib_tag%3Dse%26keywords%3Dlaptops%26qid%3D1742799244%26sr%3D8-12-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9tdGY%26psc%3D1",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:52.566054"
  },
  {
    "name": "HP 14 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 14-inch Micro-edge HD Display, Windows 11 Home, Thin & Portable, 4K Graphics, One Year of Microsoft 365 (14-dq0040nr, Snowflake White)",
    "price": 0.0,
    "description": "The Snowflake White HP 14 Laptop is designed to keep you productive and entertained from anywhere. Maximize your viewing area and see every detail thanks to 6.5 mm micro-edge bezel display, 79% screen-to-body ratio, and 14-inch HD (1366 x 768) display (1) (2). Performance, power consumption, and value come together in the Intel® Celeron® N4020, the ideal processor for your busiest days (3). Enjoy the highest resolution games and movies with the 4K-ready Intel® UHD Graphics 600 (4) (5). Store more of what you love and multitask faster, even with multiple windows open, with this HP laptop’s 64 GB of eMMC storage and 4 GB of RAM (6). Up your creativity and efficiency as this HP 14-inch laptop offers even more features for computing from anywhere. Spend more time focused on your daily tasks and less on the battery life with up to 11 hours and 30 minutes of power (7). Plus, HP Fast Charge keeps you powered especially if you need recharge quickly (8). The exceedingly secure Windows 10 Home in S mode outfits your PC laptop with fast boot times, increased responsiveness, and added protection against phishing and malware (9). Work confidently with 1-year limited hardware warranty and stay connected with the dependable Wi-Fi 5 (1x1) and Bluetooth® 4.2 combo (10) (11). Boost your creativity as your Windows laptop comes with a 1-year subscription to Microsoft 365, including the whole Office Suite: Word, Excel, and PowerPoint (12). Productivity and entertainment features aren’t the only things your device is equipped with; lead a sustainable lifestyle with a thin laptop that is ENERGY STAR® certified and EPEAT® Silver registered (13) (14). (1) Percent of the active plus inactive viewing area to active viewing area plus border. Measure with lid vertical to the desk. (2) High-definition (HD) content is required to view high-definition images. (3) Multi-core is designed to improve the performance of certain software products. Not all customers or software applications will necessarily benefit from the use of this technology. Performance and clock frequency will vary depending on application workload and your hardware and software configurations. Intel’s numbering, branding, and/or naming is not a measurement of higher performance. Intel, Pentium, Intel Core, Celeron, Iris Xe, Intel logo, and the Intel Inside logo are trademarks of Intel Corporation in the U.S. and other countries. (4) Wireless access point and internet service required and sold separately. The availability of public wireless access points is limited. (5) Graphics output may be limited based on the maximum resolution of the display. Shared video memory (UMA) uses part of the total system memory for video performance. System memory dedicated to video performance is not available for other use by other programs. (6) For storage drives, GB = 1 billion bytes. The actual formatted capacity is less. Up to 5.1GB of disk is reserved for system recovery software. (7) Battery life tested by HP using continuous FHD video playback, 1080p (1920x1080) resolution, 150 nits brightness, system audio level at 17%, player audio level at 100%, played full-screen from local storage, headphone attached, wireless on but not connected. Actual battery life will vary depending on configuration and maximum capacity will naturally decrease with time and usage. (8) Features may require software or other 3rd party applications to provide the described functionality. Internet service required and not included. (9) Not all features are available in all editions or versions of Windows. Systems may require upgraded and/or separately purchased hardware, drivers, software, or BIOS update to take full advantage of Windows functionality. Windows 10 is automatically updated, which is always enabled. ISP fees may apply and additional requirements may apply over time for updates.Windows 10 Home (S mode) works exclusively with apps from the Microsoft Store within Windows. Certain default settings, features, and apps cannot be changed. Some accessories and apps compatible with Windows 10 may not work (including some antivirus, PDF Writers, driver utilities, and accessibility apps) and performance may vary, even if you switch to Windows 10 Home configuration (fee may apply). You can’t switch back to Windows 10 Home (S mode).(10) Wireless access point and internet service required and sold separately. The availability of public wireless access points is limited. Wi-Fi 5 (802.11ac) is backward compatible with prior Wi-Fi 5 specs. (11) Bluetooth® is a trademark owned by its proprietor and used by Hewlett-Packard Company under license. (12) Microsoft 365 Personal 1-year subscription included. Activation is required within 6-months of the Windows activation date. Microsoft 365 Family and Microsoft 365 Personal have non-commercial rights and are meant for personal use only. See microsoft.com for full details. (13) ENERGY STAR and the ENERGY STAR mark are registered trademarks owned by the U.S. Environmental Protection Agency. (14) Based on U.S. EPEAT® registration according to IEEE 1680.1-2018 EPEAT®. EPEAT® status varies by country.",
    "rating": 4.1,
    "image_url": "https://m.media-amazon.com/images/I/815uX7wkOZS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/HP-Micro-edge-Microsoft-14-dq0040nr-Snowflake/dp/B0947BJ67M/ref=sr_1_3?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-3",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:54:58.145866"
  },
  {
    "name": "Dell Inspiron Touchscreen Laptop, 15.6\" Business & Student Laptop Computer, Windows 11 Pro Laptop 32GB RAM 1TB SSD, Intel i5-1155G7 Processor, Full HD IPS Display, Numeric Keypad, HDMI, Carbon Black",
    "price": 0.0,
    "description": "This portable laptop is a thoughtful design and has all the essential features to keep you connected throughout the day. Windows 11 Pro experienced the most secure Windows ever built with fast boot times, and increased responsiveness. 15.6\" Full HD touchscreen for hands-on control and the 1920 x 1080 resolution boasts impressive color and clarity. IPS technology for wide viewing angles.",
    "rating": 4.0,
    "image_url": "https://m.media-amazon.com/images/I/61Wc1fDGJuL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/Dell-Inspiron-Touchscreen-i5-1155G7-Processor/dp/B0CTPCTW66/ref=sr_1_11?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-11",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:03.594051"
  },
  {
    "name": "NIMO 15.6 IPS FHD-Laptop, 16GB RAM 1TB SSD Intel Pentium Quad Core N100, Computer with Backlit Keyboard Fingerprint (Beat to i3-1115G4 Up to 3.4GHz) Laptops for Student, Win 11 Rose Gold",
    "price": 0.0,
    "description": "About this item【2-Year Warranty & High Standard Quality】NIMO Laptops, built to high standard quality, prioritize your satisfaction with a comprehensive 2-Year Manufacturer’s Warranty from Nimo Direct Inc. Our dedicated support team ensures swift issue resolution or replacements. Enjoy risk-free exploration with 90-Day Hassle-Free Returns and partial US assembly, reflecting our commitment to reliability and excellence.【Immersive Visuals, Ultimate Comfort】Experience the NIMO Laptop’s 15.6-inch FHD Anti-Glare Display (1920x1080), featuring an 85% screen-to-body ratio and narrow bezels. Enjoy exceptional color accuracy and reduced eye strain, perfect for design, work, or leisure. This laptop transforms into your indispensable visual companion, unlocking a world of vibrant detail and possibilities.【Effortless Speed, Seamless Performance】Powered by the Intel Alder Lake-N100 12th Gen processor (3.4GHz), the NIMO Laptop delivers steady build quality engineering for reliable, long-term performance. With 4 cores and 4 threads, its Gracemont core upgrade ensures 45% faster everyday computing than predecessors. Tackle intensive workloads or multimedia seamlessly, backed by durable, precision-crafted hardware.【Upgradable Design & Durable Configuration】Future-proof your NIMO Laptop with upgradable/expandable RAM and SSD slots—easily boost storage or memory yourself. Pre-installed with 16GB DDR4 RAM and 1TB PCIe SSD, it offers lightning-fast startups and data transfers. The steady build quality metal shell (A-shell) ensures durability, combining ruggedness with sleek aesthetics for daily resilience.【Compact Powerhouse for On-the-Go Productivity】Designed for mobility, the NIMO Laptop features a backlit keyboard, fingerprint sensor, and USB 3.0 ports for rapid file transfers. Wi-Fi 6 and Bluetooth 5.2 keep you connected, while the 15.6\" display ensures smooth multitasking. Whether working, studying, or streaming, this lightweight powerhouse adapts to your dynamic lifestyle.›See more product details",
    "rating": 4.6,
    "image_url": "https://m.media-amazon.com/images/I/71VvzfO4neL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/NIMO-laptop-15.6-student-computer/dp/B0D44YZQBM/ref=sr_1_14?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-14",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:08.471586"
  },
  {
    "name": "ACEMAGIC 2025 Laptop Computer with Intel Quad-Core Processor(Up to 3.4GHz), 16GB DDR4 512GB SSD, Windows 11 Gaming Laptop, 15.6\" IPS 1080P, Metal Shell, USB3.2, Long Battery Life",
    "price": 0.0,
    "description": "About this item【EFFICIENT PERFORMANCE】ACEMAGIC Laptop featuring the latest Intel 12th Gen Alder Lake N95 processor (4 cores/4 threads, 6MB cache, up to 3.4GHz). Its performance is far 𝐦𝐨𝐫𝐞 𝐭𝐡𝐚𝐧 𝟑𝟎% better than the Pentium N5030 and Celeron N5095, providing more powerful multitasking capabilities and stronger graphics processing performance. ACEMAGIC traditional laptop is designed to elevate your computing experience.【16GB RAM & 512GB ROM】Equipped with 16GB of DDR4 RAM and a fast 512GB M.2 SSD, this windows laptop delivers up to 50% better performance than DDR3 models, ensuring smooth system operation and efficient handling of personal files. It also supports storage expansion via a 128GB TF card, and the 512GB SSD can be upgraded to a maximum of 2TB, providing ample space for all your files and favorites.【IMMERSIVE IPS DISPLAY】This 15.6 inch laptop features an innovative thin-bezel display that provides more usable onscreen space for immersive FHD viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in front webcam centered above the screen frame, take photos or video calls at any time.【SEAMLESS CONNECTIVITY】The AX15 laptop computer is equipped with a versatile array of ports, including HDMI Type A x1, USB 2.0 x1, USB 3.2 x2, Type-C (Data) x1, 3.5mm Headphone jack x1, 128GB TF Card Socket x1, and Type-C DC Jack x1. Enjoy lightning-fast 802.11ac WiFi, delivering speeds up to three times faster than 802.11n for swift downloads and streaming. Additionally, it boasts Bluetooth 5.0 for effortless and stable connections with nearby devices.【ACEMAGIC CARE FOR YOU】 This traditional laptop computer will easily slip into a backpack to be taken anywhere you need to go. With a flat hinge allowing laptop to 180°. The metal body is designed to withstand pressure and collision. We offer lifetime technical support and 12 months quality warranty for customers. If you have any questions in use, please feel free to contact us.›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/71sbZ7peiCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/ACEMAGIC-Computer-Quad-Core-Processor-Windows/dp/B0DWJYR8RW/ref=sr_1_16?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-16",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:13.072570"
  },
  {
    "name": "VGKE 15.6\" Laptop Computer, 1920 * 1080p Student Laptop with Backlit Keyboard, 12GB DDR4 RAM 256GB SSD, Intel Celeron Quad-Core J4125 Processor, Fingerprint Reader, Webcam, Silver",
    "price": 0.0,
    "description": "About this item15.6\" FHD Display & Full-size Backlit Keyboard: B15 laptop computer comes with a 15.6-inch Full High Definition (1920*1080) IPS display, brightness up to 350nits, and the anti-glare feature protects your eyes from harmful blue light. The B15 laptop with full-size backlit keyboard enhances notebook typing convenience, and the independent numeric keypad makes input faster and more convenient. Press Fn+F5 at the same time to turn on the backlit keyboard.Powerful Central Processor: B15 window laptop is powered by an Intel Celeron J4125 processor, 4-Cores &4-threads, main frequency up to 2.70 GHz, 4 MB Cahce, integrated Intel UHD Graphics 600 with low power consumption of 10W. This is a computer CPU that combines energy efficiency with performance, allowing you to easily cope with the busiest work.Memory & Storage: B15 work laptop uses a storage combination of 12GB DDR4 RAM and 256 GB PCIe NVMe M.2 SSD, which dramatically improves system responsiveness and storage speeds for efficient and smooth multitasking and high-capacity data access.Webcam & Fingerprint Reader: VGKE laptop with fingerprint reader has a built-in 720p HD webcam with temporal noise reduction and an integrated dual-array digital microphone. Meanwhile, the built-in fingerprint reader can enhance the protection of personal privacy and information security.Operating System: B15 traditional laptop is pre-installed with the latest version of the system, which brings more beautiful and simple humanized interface, more window layout options, multi-monitor function, and is compatible with a variety of software and Android apps, which can satisfy the various needs of students, teachers, business people, corporate users and professional developers.›See more product details",
    "rating": 0.0,
    "image_url": "https://m.media-amazon.com/images/I/61wSVujsIvL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/VGKE-Computer-Quad-Core-Processor-Fingerprint/dp/B0DWSLBTZM/ref=sr_1_10?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-10",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:17.467610"
  },
  {
    "name": "Gaming Laptop, Laptop Computer with AMD Ryzen 7 5700U (8C/16T, Up to 4.3GHz), 16GB RAM 512GB NVMe SSD Windows 11 laptop, Radeon RX Vega 8 Graphics, 16.1-inch Display, WiFi 6, 53Wh Battery, Backlit KB",
    "price": 0.0,
    "description": "About this item【Enhanced Gaming Experience】The KAIGERR 2025 AX16PRO gaming laptop is equipped with the powerful AMD Ryzen 7 5700U processor (8C/16T, up to 4.3GHz), delivering superior performance and responsiveness. This upgraded hardware ensures smooth gameplay, fast loading times, and high-quality visuals. It provides an immersive, lag-free gaming experience that brings your favorite titles to life.【16.1\" High-Definition IPS Screen】With its wide color gamut and high refresh rate, this laptop delivers smoother visuals and sharper detail, offering a more vivid and accurate representation than standard displays. This enhanced clarity brings a stunning and immersive visual experience, making every scene more dynamic.【Upgradeable Storage Capacity】This laptop computer comes with 16GB of DDR4 RAM and a 512GB M.2 NVMe SSD, ensuring faster response times and ample storage for your files. The dual-channel DDR4 memory can be upgraded to 64GB (2x32GB), while the NVMe/NGFF SSD supports expansion up to 2TB. With this level of upgradeability, you'll have more than enough space to store all your favorite games and handle even the most demanding tasks with ease.【Extensive & Premium Connectivity】Designed for ultra-fast gaming, KAIGERR windows laptop is equipped with webcam × 1, USB 3.2 × 2, HDMI × 1, Type_C (full function) × 1, 3.5mm audio/microphone × 1, TF card holder × 1, Type_C DC jack × 1. Enjoy higher speeds with Wi-Fi 6, compatible with the 802.11ax standard and up to 3x faster than Wi-Fi 5. Paired with the backlit keyboard, it helps you be more immersed in the game world.【KAIGERR: Quality Laptops, Exceptional Support.】Enjoy peace of mind with unlimited technical support and 12 months of repair for all customers, with our team always ready to help. If you have any questions or concerns, feel free to reach out to us—we’re here to help.›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/81jFW4cV7bL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/Computer-Windows-Graphics-16-1-inch-Display/dp/B0DTDY149F/ref=sr_1_7?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-7",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:21.750429"
  },
  {
    "name": "jumper Laptop, 12GB RAM 640GB Storage, 5305U Processor, Office 365-1 Year, 15.6 Inch Computer, FHD IPS Screen, 38Wh Battery, 2 Stereo Speakers, USB3.0 * 2, Type-C, WiFi-5.",
    "price": 0.0,
    "description": "About this itemHigh Speed Less Waiting: High Performance Processor 5305U, Base Frequency 2.3GHz, Integrated UHD Graphics 300MHz, 2MB L2 Cache, 14nm Lithography, 2-core 2-threadFast Response Large Storage: 12GB RAM memory responds faster to your commands, 640GB ROM (128GB EMMC + 512GB SSD) accommodates efficient operation of the most complex application and multimediaRealistic Visual Enjoyment: 15.6 Inch FHD IPS screen with a resolution of 1920 x 1080 pixels, 16 : 9 widescreen display, 5mm narrow bezels,eye-friendly protection, anti glare coatingWork and study Anytime: Comes with a 1 year licence of office 365 pre-installed, for all your daily computing needs, an ideal laptop for basic home use and kids school work with Word、Excel、PowerPoint、Outlook、OneNoteMultifunctional Connection Design: 38Wh battery, 2 stereo speakers, Bluetooth 4.2 and dual-band Wi-Fi(2.4G/5G) fast wireless. Type-C port x 1, Mini HDMI × 1, 3.5mm headphone jack x 1, USB 3.0 port x 2, Micro TF slot x 1, fast charger DC port›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/81J4NJ9ZiGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/jumper-5305U-Processor-Computer-Speakers/dp/B0DWDWZXCS/ref=sr_1_4?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-4",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:26.457679"
  },
  {
    "name": "HP Chromebook 14 Laptop, Intel Celeron N4120, 4 GB RAM, 64 GB eMMC, 14\" HD Display, Chrome OS, Thin Design, 4K Graphics, Long Battery Life, Ash Gray Keyboard (14a-na0226nr, 2022, Mineral Silver)",
    "price": 0.0,
    "description": "Whether you need a laptop for work, college, or everyday computing, the HP Chromebook 14 Laptop has got you covered. Watch movies or view spreadsheets in high-quality HD and in direct sunlight with a 14-inch anti-glare, micro-edge screen (1). Plus, with custom-tuned dual speakers, you’ll enjoy clear authentic audio to elevate all of your entertainment needs. Not only is this Chromebook outfitted for relaxing, but it’s also a productivity powerhouse. The HP laptop computer’s portable and lightweight design lets you take it just about anywhere, while the Intel® Celeron N4120 processor touts plenty of power for even your busiest days (2). Enjoy the highest resolution games and movies with the 4K-ready Intel UHD Graphics 600 (3) (4). Multitask faster, even with multiple windows open, and safely store more content with this HP 14-inch laptop’s 4 GB of RAM and 64 GB of eMMC storage (5).Pull all-nighters or binge-watch your favorite show with confidence thanks to your HP notebook computer’s 14 hours of battery life (6). When you do run short on power, just plug in your Chromebook charger and HP Fast Charge takes your battery to 50% in just 45 minutes (7). Not only does the Chrome OS give you greater security and an always up-to-date experience, but you can also take advantage of millions of apps in the Google Play Store (8). Work confidently with a 1-year limited hardware warranty and stay connected with the dependable 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth combo (9) (10). Expand the way you game, work, and create with the innovative HP Imagepad, a true multi-touch touchpad that supports four-finger gestures. Your HP 4K laptop isn’t just built for greater productivity and more immersive entertainment, but also for sustainability. Do your part toward a cleaner planet with an ENERGY STAR certified (11) and EPEAT Silver registered (12) Chromebook 14-inch.",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/71tXLOE7wIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/HP-Chromebook-Graphics-Keyboard-14a-na0226nr/dp/B09SVSBVP1/ref=sr_1_18?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-18",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:31.838300"
  },
  {
    "name": "VisionTek VT4500 12in1 Docking Station Dual Monitor 4K – x2 HDMI, x2 DisplayPort, 60W USB-C PD, x4 USB-A 3.0, x2 5Gbps USB-C, 3.5mm Audio Jack, & Ethernet – Compatible with Laptop, PC, and MacBook",
    "price": 92.04,
    "description": "The VisionTek USB dual 4K universal docking station allows you to easily connect your Windows, Mac OS or Chrome OS laptop to dual-4K displays and up to eleven accessories and peripherals through a single USB connection. This high-quality dock is a single-cable solution that enables you to take full advantage of up to three monitors and Ultra HD technology, even if it isn't natively supported by your computer's video card. You can easily turn your laptop into a complete workstation by adding peripherals such as a full-sized keyboard, mouse, external hard drives, printers, webcams and projectors. This all-in-one dock delivers a total of 11 ports in a unit designed to instantly connect and disconnect from your USB laptop through a single high-speed cable. Featuring DisplayPort multi-stream transport, USB Type A and type C connectivity, HDMI, audio and Ethernet connections, This full-featured USB dock allows your laptop to perform like a desktop. This single-cable docking station is ideal for creative professionals such as video producers, graphic and web designers, engineers, architects, students, gamers and more, including graphic and web designers, animators, and professionals who work with highly detailed graphics. The ability to scale your desktop across multiple displays also makes this dock perfect for government, finance, Medical imagery, marketing and Sales environments or other complex work. The VisionTek USB dual 4K universal docking station supports resolutions up to dual 4K HDMI, 4K DisplayPort, 4K HDMI + 4K DisplayPort output in both extended and mirrored modes. In addition to being compatible with both Type-C and Type-A laptop and desktop computers, This docking station also supports Microphone input and audio output, USB 3. 0 With transfer speeds up to 5Gbps and backward compatible with USB 2. 0 and USB 1. 1 and USB Type-C. Built in 10/100/1000Base-T Gigabit Ethernet RJ45 port.",
    "rating": 4.4,
    "image_url": "https://m.media-amazon.com/images/I/61FELKHV9BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/sspa/click?ie=UTF8&spc=MTo0ODM4NTQ2Nzk5MTk4MDg0OjE3NDI3OTkyNDQ6c3BfYXRmOjMwMDUxODg2Njg2MzUwMjo6MDo6&url=%2FVisionTek-Universal-Monitor-Docking-Station%2Fdp%2FB07QBM87KS%2Fref%3Dsr_1_1_sspa%3Fdib%3DeyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU%26dib_tag%3Dse%26keywords%3Dlaptops%26qid%3D1742799244%26sr%3D8-1-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGY%26psc%3D1",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:36.562968"
  },
  {
    "name": "jumper Laptop Computer 16 inch FHD Display, 12GB RAM, 256GB SSD, 128GB eMMC, 5G/2.4G WiFi, Type-C, HDMI, Numeric Keypad, Bluetooth, 38Wh Battery, 5305U Processor, Cooling System",
    "price": 0.0,
    "description": "About this itemPowerful Storage: This laptop comes with 12GB DDR4 RAM memory, 348GB (128GB eMMC + 256GB SSD) storage. The computer also supports 512GB TF card expansion to ensure that the system runs smoothly and the storage space is large enough for your work and lifePowerful Fan Cooling: The laptop is equipped with a fan at the bottom to ensure effective heat dissipation and provide stable performance for your daily work. You don't need to worry about running slowly anymore16 Inch FHD Display: The laptop features a high-resolution 1920*1200 IPS and narrow bezel display. It offers more screen real estate, vivid picture quality and vibrant colors for an immersive visual experience.This laptops is ideal for work or studyAbundant Ports: Equipped with 2.4G/5G WiFi, Bluetooth 4.0, USB 3.0, Type-C, HDMI, and TF card slot, this laptops meets diverse needsEfficient Performance:Powered by a Celeron 5305U processor (2 cores, 2 threads, 2.3GHz to 2.9GHz), this laptops handles multitasking and large-scale software with ease, delivering reliable performance for both professional tasks and entertainment›See more product details",
    "rating": 5.0,
    "image_url": "https://m.media-amazon.com/images/I/71xIXYwpVzL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/jumper-Computer-Display-Bluetooth-Processor/dp/B0DQ7XG5YJ/ref=sr_1_19?dib=eyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU&dib_tag=se&keywords=laptops&qid=1742799244&sr=8-19",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:41.009146"
  },
  {
    "name": "Rapink Cat6 7ft (24 Pack) Ethernet Patch Cables, Blue, 10G, RJ45, Male-to-Male, Cat6 Ethernet Cable for Laptop, PC, Router, Server",
    "price": 0.0,
    "description": "About this item【24 Pack】24-pack of CAT6 patch cables with short length is excellent solution for connecting patch panel to switch and other various devices in high performance. Available in various colors and length of cable patch cords.【Save Time】This premium ethernet cable save hours of time and hassle of cutting and crimping custom length cables for patch panels. Don't waste time on hand-making rj45 Internet cable.【10G speed via Gold plated pins】 All 8P8C of cat 6 patch cable are golden plated to support better network connection up to 10G speed 550MHZ ethernet network. This is a well pre-made 7ft cat6 patch cable with 26AWG stranded pure copper and can be used as cat6a patch cable to upgrade cat6a network.【Upgrade and Clean Up Rack】Good size cat 6 ethernet cable 7 ft for clean wire management install. Short ethernet cable make your setup so much easier and cleaner with all same length and color. Cable patch cords is more reliable and secure than Cat5 cable network.【Easy Unplug】Premium quality and durable network patch cable is with fully molded strain relief connections and easy unplug clip protector. Ethernet network cable meets or exceeds Category 6 performance TIA/EIA 568-C.2 standard.›See more product details",
    "rating": 4.8,
    "image_url": "https://m.media-amazon.com/images/I/51NPT6ESupL._SY445_SX342_QL70_FMwebp_.jpg",
    "url": "https://www.amazon.com/sspa/click?ie=UTF8&spc=MTo0ODM4NTQ2Nzk5MTk4MDg0OjE3NDI3OTkyNDQ6c3BfYnRmOjMwMDY5MjQzOTYxNzYwMjo6MDo6&url=%2FRapink-Cables-Ethernet-Switch-Flexiable%2Fdp%2FB0CXWRCRXT%2Fref%3Dsr_1_20_sspa%3Fdib%3DeyJ2IjoiMSJ9.iBCtzwnCm6CE8Bx8hKmQ8f0e9LpOzuGqWaTtvKi7PYG9kFWu6LBnQF6-KLXPh3r1F7YcSgzA7iJpg9yYDIXoeJli-aqslSXxVub3UHovt4acY6PEQ8SKKMKRC21V7MhzOtXt6v2bUfC4zh7HEpMFpWgDD9z4XetA9nvG1DThGyfDceORA46qodD1W4yypIhZAVA0PurUyIba4l58FRLh-5Td5ivnT-O_vSEIX924qms.nqP0A1sGlEKf3pgG_N1zOqtXHpOJfiEBL6VChfMUARU%26dib_tag%3Dse%26keywords%3Dlaptops%26qid%3D1742799244%26sr%3D8-20-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9idGY%26psc%3D1",
    "source": "amazon",
    "scraped_at": "2025-03-24T06:55:46.659785"
  }
]